Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаНакладных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьДублиСерий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязыватьИнвойсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Контрагенты/Ext/Module.bsl
// ─── Поиск контрагента ───────────────────────────────────────────────────────

// Поиск контрагента по коду или наименованию (поддержка legacy-полей customer/customerCode).
Функция НайтиКонтрагента(ДанныеЗапроса) Экспорт
	
	Если ДанныеЗапроса.Свойство("counterpartyCode") И СокрЛП(ДанныеЗапроса.counterpartyCode) <> "" Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(СокрЛП(ДанныеЗапроса.counterpartyCode));
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Возврат Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("customerCode") И СокрЛП(ДанныеЗапроса.customerCode) <> "" Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(СокрЛП(ДанныеЗапроса.customerCode));
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Возврат Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("counterparty") И СокрЛП(ДанныеЗапроса.counterparty) <> "" Тогда
		Возврат Справочники.Контрагенты.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.counterparty), Истина);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("customer") И СокрЛП(ДанныеЗапроса.customer) <> "" Тогда
		Возврат Справочники.Контрагенты.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.customer), Истина);
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

// ─── Список контрагентов и CRUD ───────────────────────────────────────────── 

Функция НаименованиеКонтрагентаИзЗапроса(ДанныеЗапроса)
	
	Если ДанныеЗапроса.Свойство("counterparty") И СокрЛП(ДанныеЗапроса.counterparty) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.counterparty);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("name") И СокрЛП(ДанныеЗапроса.name) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.name);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("customer") И СокрЛП(ДанныеЗапроса.customer) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.customer);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция СтруктураКонтрагентаJSON(Стр)
	
	Элемент = Новый Структура;
	Элемент.Вставить("counterparty", 		Стр.Наименование);
	Элемент.Вставить("counterpartyCode", 	StockAPI_Утилиты.КодВСтроку(Стр.Код));
	Элемент.Вставить("email", 				Стр.email);
	Элемент.Вставить("phone",				Стр.phone);
	Элемент.Вставить("city", 				Стр.city.Наименование);
	Элемент.Вставить("address", 			Стр.address);
	Возврат Элемент;
	
КонецФункции

Функция КоличествоКонтрагентов(СтрокаПоиска, СтрокаКода, Группа)
	
	ШаблонПоиска 	= ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", Неопределено);
	КодЧисло 		= ?(ЗначениеЗаполнено(СтрокаКода), Число(СтрокаКода), Неопределено);
	
	Зап = Новый Запрос;
	Зап.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Конт.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.Контрагенты КАК Конт
		|ГДЕ
		|	НЕ Конт.ЭтоГруппа
		|	И НЕ Конт.ПометкаУдаления
		|	И Конт.Ссылка В ИЕРАРХИИ(&Группа)
		|{ГДЕ
		|	(Конт.Код = &Код
		|			И Конт.Наименование ПОДОБНО &ШаблонПоиска)}";
	Зап.УстановитьПараметр("Группа", 		Группа);
	Зап.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	Зап.УстановитьПараметр("Код", 			КодЧисло);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция КонтрагентыСтраница(СтрокаПоиска, СтрокаКода, РазмерСтраницы, Пропустить, Группа)
	
	ШаблонПоиска 	= ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", Неопределено);
	КодЧисло 		= ?(ЗначениеЗаполнено(СтрокаКода), Число(СтрокаКода), Неопределено);
	
	Если РазмерСтраницы <= 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ " + РазмерСтраницы + ?(Пропустить > 0, " ПРОПУСТИТЬ " + Пропустить, "") + "
		//"ВЫБРАТЬ
		|	Конт.Ссылка КАК Ссылка,
		|	Конт.Код КАК Код,
		|	Конт.Наименование КАК Наименование,
		|	Конт.Email КАК email,
		|	Конт.Телефоны КАК phone,
		|	Конт.Город КАК city,
		|	Конт.Адрес КАК address
		|ИЗ
		|	Справочник.Контрагенты КАК Конт
		|ГДЕ
		|	НЕ Конт.ЭтоГруппа
		|	И НЕ Конт.ПометкаУдаления
		|	И Конт.Ссылка В ИЕРАРХИИ(&Группа)
		|{ГДЕ
		|	(Конт.Код = &Код
		|			И Конт.Наименование ПОДОБНО &ШаблонПоиска)}
		|
		|УПОРЯДОЧИТЬ ПО
		|	Конт.Наименование";
	Зап.УстановитьПараметр("Группа", 		Группа);
	Зап.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	Зап.УстановитьПараметр("Код", 			КодЧисло);
	
	Возврат Зап.Выполнить().Выгрузить();
	
КонецФункции

// GET /counterparties — список контрагентов с пагинацией; type=customer|supplier — фильтр по типу. 
//
Функция ПолучитьСписокКонтрагентов(Запрос, Группа) Экспорт
	
	Результат = Новый Структура("Тело, Ошибка", Неопределено, "");
	
	Пагинация = StockAPI_Утилиты.ПараметрыПагинацииОстатков(Запрос);
	Если Пагинация.Ошибка <> "" Тогда
		Результат.Ошибка = Пагинация.Ошибка;
		Возврат Результат;
	КонецЕсли;
	
	СтрокаПоиска = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "search");
	СтрокаКода = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "counterpartyCode");
	Если СтрокаКода = "" Тогда
		СтрокаКода = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "code");
	КонецЕсли;
	
	ВсегоКонтрагентов = КоличествоКонтрагентов(СтрокаПоиска, СтрокаКода, Группа);
	ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоКонтрагентов, Пагинация.pageSize);
	Пропустить = (Пагинация.page - 1) * Пагинация.pageSize;
	Таблица = КонтрагентыСтраница(СтрокаПоиска, СтрокаКода, Пагинация.pageSize, Пропустить, Группа);
	
	Массив = Новый Массив;
	Для Каждого Стр Из Таблица Цикл
		Массив.Добавить(СтруктураКонтрагентаJSON(Стр));
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("page", 		Пагинация.page);
	ТелоОтвета.Вставить("pageSize", 	Пагинация.pageSize);
	ТелоОтвета.Вставить("totalItems", 	ВсегоКонтрагентов);
	ТелоОтвета.Вставить("totalPages", 	ВсегоСтраниц);
	ТелоОтвета.Вставить("items", 		Массив);
	Результат.Тело = ТелоОтвета;
	Возврат Результат;
	
КонецФункции

// POST /counterparties — создание контрагента в справочнике.
//
Функция СоздатьКонтрагента(ДанныеЗапроса, Группа) Экспорт
	
	Результат = Новый Структура("success, error, counterparty, counterpartyCode", Ложь, "", "", "");
	
	Наименование = НаименованиеКонтрагентаИзЗапроса(ДанныеЗапроса);
	Если Наименование = "" Тогда
		Результат.error = "Укажите counterparty, name или customer (наименование контрагента).";
		Возврат Результат;
	КонецЕсли;
	
	Существующий = Справочники.Контрагенты.НайтиПоНаименованию(Наименование, Истина, Группа);
	Если ЗначениеЗаполнено(Существующий) Тогда
		Результат.error = СтрШаблон("Контрагент ""%1"" уже существует (код %2).",
			Наименование,
			StockAPI_Утилиты.КодВСтроку(Существующий.Код));
		Возврат Результат;
	КонецЕсли;

	Объект = Справочники.Контрагенты.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.Родитель = Группа;
	
	Если ДанныеЗапроса.Свойство("email") Тогда
		Объект.Email = СокрЛП(ДанныеЗапроса.email);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("phone") Тогда
		Объект.Телефоны = СокрЛП(ДанныеЗапроса.phone);
	ИначеЕсли ДанныеЗапроса.Свойство("phones") Тогда
		Объект.Телефоны = СокрЛП(ДанныеЗапроса.phones);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("city") Тогда
		Объект.Город = Справочники.Города.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.city));
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("address") Тогда
		Объект.Адрес = СокрЛП(ДанныеЗапроса.address);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("note") Тогда
		Объект.Примечание = СокрЛП(ДанныеЗапроса.note);
	ИначеЕсли ДанныеЗапроса.Свойство("comment") Тогда
		Объект.Примечание = СокрЛП(ДанныеЗапроса.comment);
	КонецЕсли;
	
	Попытка
		Объект.Записать();
	Исключение
		Результат.error = "Не удалось создать контрагента: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	КодСтрокой = StockAPI_Утилиты.КодВСтроку(Объект.Код);
	
	Результат.success = Истина;
	Результат.counterparty = Объект.Наименование;
	Результат.counterpartyCode = КодСтрокой;
	Возврат Результат;
	
КонецФункции
